#include <iostream>
using namespace std;
int a = 10;
int b = 10;

int main(void)
{
    // 1 const 修饰指针
    // 常量指针
    const int *p = &a; // 不可改值
    //******错误********
    //    *p = 20
    //******错误********
    p = &b; // 可该指向

    //************************************************* */

    // 2 const修饰常量
    // 指针常量
    int *const p2 = &a; // 不可该指向
    //******错误********
    //    p = &b
    //******错误********
    *p2 = 100; // 可改值

/******************************************************* */

    // 3 const修饰指针和常量
    const int* const p3 =&a; //都不可改


    return 0;
}